// Напишите программу, которая бесконечно
// запрашивает целые числа с консоли. Программа
// завершается при вводе символа ‘q’ или при вводе
// числа, сумма цифр которого четная.

// Пример
// 5 12 16 q [STOP]
// 3 45 342 15 [STOP]

Console.Clear();
// string Numbers (string num);
// {
//    for (int i = 0; i <= num.Length; i++)
//     {
//         string p = Math.Pow(10, symbol.Length - i - 1);
//     }
//     return num;
// }


Console.WriteLine("Введите число или символ: ");
string num = Console.ReadLine();
Console.WriteLine();
