// Напишите программу, которая на вход
// принимает натуральное число N, а на выходе
// показывает его цифры через запятую.

Console.WriteLine("Введите число: ");
string num = Console.ReadLine()!;

if (num.Length == 1)
{
    Console.WriteLine(num);
}
else
{
    int l = num.Length;
    int i = 0;
    while (i < num.Lenght)
    {
        
    }
    Console.WriteLine(l);
}
